{
   "projects":[
      {
        "title":"Mathemon",
        "tech":[
          "JavaScript",
          "Angular",
          "HTML",
          "CSS",
          "Firebase"
        ],
        "topics" : [
          "Software Development",
          "User Interface"
        ],
        "description":"Mathemon is a Pokemon inspired math games that is designed to test 4th grades on their math skills. This is a full stack applicaion with an Anuglar front-end with a Firebase database. In the application, teachers create accounts for all their students and students are then able to log in with their own accounts. A student progresses through the game by defeating the Mathemon and leveling up. Teachers can see the progress students are making with the leaderboard feature.",
        "repository":"https://github.com/nblumenfeld/software_engineering_project"
      },
      {
        "title":"Film Jamz",
        "tech":[
          "Python"
        ],
        "topics":[
          "Data Mining",
          "Data Science",
          "Machine Learning",
          "Data Visualization"
        ],
        "description":"Have you ever wondered what makes a movie succesful? What defines a successful movie, box office numbers or IMDb rating? In Film Jamz, we utilized a massive movie data table and used advanced data mining techniques to answer these questions. Using Python libraries such as sklearn, scipy, numpy, seaborn, and bokeh, we tested and implemented different data mining algorithms and created beautiful visualizations. ",
        "repository":"https://github.com/aidanpirish/filmjamz"
      },
      {
        "title":"Chat Server",
        "tech":[
          "HTTP",
          "Node.js",
          "HTML",
          "CSS"
        ],
        "topics":[
          "Networks",
          "User Interface",
          "Web Development"
        ],
        "description":"This chat server is an easy-to-use messaging application that can be used on any browser. A user can start the server on their machine, and other users can connect to their server and chat through the browser. This application utilizes the Node.js libraries HTTP and socket.io. The most powerful part of this application is the ability to send private messages.",
        "repository":"https://github.com/aidanpirish/chatroom"
     },
     {
        "title":"Utah Animal Adoption Center Web App",
        "tech":[
          "JavaScript",
          "Node.js",
          "MySQL",
          "HTML",
          "CSS",
          "Google Cloud Platform"
        ],
        "topics":[
          "Databases",
          "Cloud Computing",
          "User Interface",
          "Web Development"
        ],
        "description":"The Utah Animal Adoption Center (UAAC) is an animal shelter and provides adoption services. UAAC oversees many animals and keeps track of all the animals going in and out. This web application aims to provide organization through a web application. Through the app, queires of all complexities are performed to display and upload information.",
        "repository":"https://github.com/aidanpirish/UAAC_DB"
   },
   {
      "title":"Financial Analysis of Pegasystems and Salesforce",
      "tech":[
        "Python"
      ],
      "topics":[
        "Data Science",
        "Financial Analysis",
        "Data Visualization"
      ],
      "description":"In my final class to complete my business minor, I wanted to incorpoorate all the Python I had learned that semester into a project that compares the finacial health of two companies. This project started by making csv tables from financial reports of two software companies, Pegasystems and Salesforce. The tables were then imported to a Jupyter Notebook. I utilized pandas to anaylze the data, and matplotlib to create visualizations.",
      "repository":"https://github.com/aidanpirish/financial_analysis"
    },
    {
      "title":"Web Server",
      "tech":[
        "Java",
        "HTTP"
      ],
      "topics":[
        "Concurrency",
        "Multithreading",
        "Networks",
        "Web Development"
      ],
      "description":"This web server was completed for a homework assignment in Networks. The program uses a simple HTML document and opens up a port for connections. Each connection takes place within a thread. After completing this assignement, I had a newfound appreciation for multithreading and concurrency.",
      "repository":"https://github.com/aidanpirish/WebServer"
    },
    {
      "title":"CI Demo",
      "tech":[
        "Node.js",
        "Docker",
        "Kubernetes",
        "YAML"
      ],
      "topics":[
        "Continuous Integration",
        "DevOps",
        "Web Development",
        "Distributed Systems"
      ],
      "description":"This porject was created as I was learning the ropes of Docker and Kubernetes. My end goal of learning these technologies was to understand the deployment of applications in Docker containers. The node application itself is a just a simple 'Hello, World!' This project introduced me to distributed systems and containers. After completing this demo, I gained a new appreciation for how much of the work is done for me when I make Node.js applications.",
      "repository":"https://github.com/aidanpirish/CI_Demo"
    }
  ]
}